Laborator 7/p1/Calculator/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://com.example.producingwebservice/Calculator">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:addRequest>
         <gs:param1>1</gs:param1>
         <gs:param2>3</gs:param2>
      </gs:addRequest>

      <gs:subtractionRequest>
         <gs:param1>9</gs:param1>
         <gs:param2>8</gs:param2>
      </gs:subtractionRequest>

      <gs:divideRequest>
         <gs:param1>4</gs:param1>
         <gs:param2>2</gs:param2>
      </gs:divideRequest>

      <gs:divideRequest>
         <gs:param1>4</gs:param1>
         <gs:param2>2</gs:param2>
      </gs:divideRequest>

   </soapenv:Body>
</soapenv:Envelope>
